Картриджи/src/DataProcessors/НаличиеКартриджей/НаличиеКартриджей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>НаличиеКартриджей</name>
</mdclass:DataProcessor>

Картриджи/src/AccumulationRegisters/ОстаткиКартриджей/ОстаткиКартриджей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиКартриджей</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Картридж</name>
    <type>
      <types>CatalogRef.МоделиКартриджей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделения</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Картриджи/src/Enums/ВидыПодразделений/ВидыПодразделений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПодразделений</name>
  <enumValues>
    <name>ЗаправляющаяОрганизация</name>
  </enumValues>
</mdclass:Enum>

Картриджи/src/DataProcessors/НаличиеКартриджей/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПоСтелажу();
	//НАЗаправке();
	
КонецПроцедуры

&НаСервере
Процедура ПоСтелажу()
  	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиКартриджейОстатки.Картридж,
		|	ОстаткиКартриджейОстатки.Подразделения,
		|	ОстаткиКартриджейОстатки.КоличествоОстаток КАК Остаток
		|ИЗ
		|	РегистрНакопления.ОстаткиКартриджей.Остатки КАК ОстаткиКартриджейОстатки
		|ГДЕ
		|	ОстаткиКартриджейОстатки.КоличествоОстаток > 0
		|	И ОстаткиКартриджейОстатки.Подразделения.Склад = ИСТИНА";

	Результат = Запрос.Выполнить();

    НаСтелаже1.Очистить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = НаСтелаже1.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура НАЗаправке()
	
  	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиКартриджейОстатки.Картридж,
		|	ОстаткиКартриджейОстатки.Подразделения,
		|	ОстаткиКартриджейОстатки.КоличествоОстаток КАК Остаток
		|ИЗ
		|	РегистрНакопления.ОстаткиКартриджей.Остатки КАК ОстаткиКартриджейОстатки
		|ГДЕ
		|	ОстаткиКартриджейОстатки.Подразделения.ВидПодразделения = ЗНАЧЕНИЕ(Перечисление.ВидыПодразделений.ЗаправляющаяОрганизация)
		|	И ОстаткиКартриджейОстатки.КоличествоОстаток > 0";

	Результат = Запрос.Выполнить();
   	НаЗаправке1.Очистить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = НаЗаправке1.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		
	КонецЦикла;

КонецПроцедуры
